app/Controllers/Akademik.php

    public function kegiatanWawasan()
    {
        $model = new DokumenModel();
        $data['dokumen'] = $model->findAll();
---
SELECT *
FROM `dokumen`